app/views/cuisines/show.html.erb


<% if @cuisine.recipes.empty? %>
---
SELECT  1 AS one FROM "recipes" WHERE "recipes"."cuisine_id" = ? LIMIT ?  [["cuisine_id", 2], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."cuisine_id" = ?  [["cuisine_id", 1]]