app/controllers/recipes_controller.rb

SELECT "cuisines".* FROM "cuisines"
---
  def new
    @recipe = Recipe.new
    @cuisines = Cuisine.all

INSERT INTO "recipes" ("title", "recipe_type", "difficulty", "cook_time", "created_at", "updated_at", "cook_method", "ingredients", "cuisine_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    recipe_params = params.require(:recipe).permit(:title, :recipe_type, :cuisine_id, :difficulty, :ingredients, :cook_time, :cook_method)
    @recipe = Recipe.new(recipe_params)
    @recipe.save