app/controllers/welcome_controller.rb

  def index
    @recipes = Recipe.all()
    @cuisines = Cuisine.all
---
SELECT "recipes".* FROM "recipes"
SELECT "cuisines".* FROM "cuisines"